Revit 2027 API
ElectricalAnalyticalNode.ConnectToUpstreamNode Method
 Connects to upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ConnectToUpstreamNode(
	ElementId upstreamNodeId
)
Public Sub ConnectToUpstreamNode (
	upstreamNodeId As ElementId
)
public:
void ConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
member ConnectToUpstreamNode :
        upstreamNodeId : ElementId -> unit
Parameters
upstreamNodeId ElementId
 The upstream node id.
Exceptions
Exception | Condition
ArgumentException |  The id is not an analytical distribution node id. -or- The analytical distribution node is full of downstream nodes. -or- The analytical distribution node can not connect to the upstream node.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The analytical distribution node is full of upstream nodes.
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace